In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("E:/Median.csv")

In [3]:
data

    Student  Overall Marks  Gender    Subject
0     Anish           9700    Male    English
1   Rishabh             83    Male    English
2      Ajay             78    Male    Physics
3   Abhinav             86    Male  Chemistry
4    Anurag             91    Male    English
..      ...            ...     ...        ...
95  Aaditya             77    Male  Chemistry
96    vivek             55    Male    Physics
97    Tisha              7  Female    English
98   Raghav             73    Male    English
99   Ishita             82  Female  Chemistry

[100 rows x 4 columns]

In [4]:
data.mode()

     Student  Overall Marks Gender    Subject
0       ALOK           88.0   Male  Chemistry
1    Aaditya            NaN    NaN        NaN
2    Abhinav            NaN    NaN        NaN
3   Abhishek            NaN    NaN        NaN
4     Aditya            NaN    NaN        NaN
..       ...            ...    ...        ...
95    vedant            NaN    NaN        NaN
96     vikas            NaN    NaN        NaN
97    vishal            NaN    NaN        NaN
98     vivek            NaN    NaN        NaN
99      yash            NaN    NaN        NaN

[100 rows x 4 columns]

In [6]:
mean = data['Overall Marks'].mean()

In [7]:
mean

164.24

In [8]:
median = data['Overall Marks'].median()

In [9]:
median

77.0

In [10]:
q1 =  data['Overall Marks'].quantile(0.25)
q2 =  data['Overall Marks'].quantile(0.50)
q3 =  data['Overall Marks'].quantile(0.75)
q4 =  data['Overall Marks'].quantile(1)

In [11]:
q1

57.25

In [12]:
q2 
q3
q4

9700.0

In [13]:
print(q2)
print(q3)

77.0
87.25

In [16]:
data["Overall Marks"][0] = 9700

C:\Users\amank\AppData\Local\Temp\ipykernel_25508\2482970066.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data["Overall Marks"][0] = 9700

In [17]:
data

    Student  Overall Marks  Gender    Subject
0     Anish           9700    Male    English
1   Rishabh             83    Male    English
2      Ajay             78    Male    Physics
3   Abhinav             86    Male  Chemistry
4    Anurag             91    Male    English
..      ...            ...     ...        ...
95  Aaditya             77    Male  Chemistry
96    vivek             55    Male    Physics
97    Tisha              7  Female    English
98   Raghav             73    Male    English
99   Ishita             82  Female  Chemistry

[100 rows x 4 columns]

# Spread of Data

In [18]:
max_data = data["Overall Marks"].max()

In [19]:
max_data

9700

In [20]:
min_data = data["Overall Marks"].min()

In [21]:
min_data

0

In [22]:
rangedata = max_data - min_data

In [23]:
rangedata

9700

In [24]:
# now as there an outlier present in the data so we have to calculate the 1st & 3rd quantile
q1 = data["Overall Marks"].quantile(0.25)
q2 = data["Overall Marks"].quantile(0.75)

In [25]:
Iqr = q2-q1

In [26]:
Iqr

30.0

# variance

In [27]:
# Steps to calculate variance
# 1. calc mean
# 2. cal the distance from mean for each element
# 3. calc sqrd distance
# 4. Take avg of the sqrd distamce

In [28]:
mean = data["Overall Marks"].mean()

In [29]:
mean

164.24

In [30]:
diff = data["Overall Marks"]  - mean

In [31]:
diff

0     9535.76
1      -81.24
2      -86.24
3      -78.24
4      -73.24
       ...
95     -87.24
96    -109.24
97    -157.24
98     -91.24
99     -82.24
Name: Overall Marks, Length: 100, dtype: float64

In [32]:
squared_dist  = diff**2

In [33]:
squared_dist

0     9.093072e+07
1     6.599938e+03
2     7.437338e+03
3     6.121498e+03
4     5.364098e+03
          ...
95    7.610818e+03
96    1.193338e+04
97    2.472442e+04
98    8.324738e+03
99    6.763418e+03
Name: Overall Marks, Length: 100, dtype: float64

In [34]:
variance = squared_dist.mean()

In [35]:
variance

919170.8423999996

In [36]:
var_data = data["Overall Marks"].var(ddof=0)

In [37]:
var_data

919170.8423999996

In [38]:
import numpy as np

In [39]:
l = np.array([7,6,8,4,2,7,6,7,6,5])

In [40]:
l

array([7, 6, 8, 4, 2, 7, 6, 7, 6, 5])

In [41]:
l.var(ddof=0)

2.7600000000000002

# Standard Deviation

In [44]:
variance

919170.8423999996

In [45]:
stand_dev = variance**(1/2)

In [46]:
stand_dev

958.7339789534944

In [47]:
std = data["Overall Marks"].std(ddof=0)

In [48]:
std

958.7339789534944

In [49]:
data.head()

   Student  Overall Marks Gender    Subject
0    Anish           9700   Male    English
1  Rishabh             83   Male    English
2     Ajay             78   Male    Physics
3  Abhinav             86   Male  Chemistry
4   Anurag             91   Male    English

In [50]:
freq_data = data["Subject"].value_counts()

In [51]:
freq_data

Chemistry    36
Physics      35
English      29
Name: Subject, dtype: int64